# Taps
tap "homebrew/bundle"
tap "homebrew/services"
tap "muesli/tap"

# Base dependencies
brew "openssl@3"
brew "curl"
brew "git"
brew "git-lfs"
brew "wget"

# Shell and terminal utilities
brew "zsh-async"
brew "zsh-completions"
brew "tmux"
brew "reattach-to-user-namespace"  # Required for tmux copy-paste
brew "direnv"
brew "mise"  # Polyglot runtime manager (asdf replacement)
brew "fzf"
brew "gh"
brew "ghq"
brew "peco"
brew "tree"
brew "bat"  # Better cat
brew "z"    # Directory jumper
brew "ripgrep"  # Better grep
brew "eza"  # Better ls (replacement for exa)
brew "delta"  # Better git diff
brew "tldr"  # Simplified man pages
brew "jq"  # JSON processor
brew "yq"  # YAML processor
brew "fd"  # Better find

# Development tools
brew "go"
brew "node"
brew "python"
brew "rust"
brew "perl"
brew "ruby"
brew "typescript"
brew "pkg-config"

# Image and video processing
brew "ffmpeg"
brew "opencv"
brew "jpeg"

# Network tools
brew "arp-scan"
brew "httpie"
brew "nmap"

# Container and virtualization
brew "docker"
brew "docker-compose"
brew "docker-credential-helper"

# Document processing
brew "pandoc"
brew "graphviz"

# macOS Applications
cask "audio-hijack"
cask "deepl"
cask "flux"
cask "font-fontawesome"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "loopback"
cask "notion"
cask "obs"
cask "processing"
cask "rectangle"
cask "rescuetime"
cask "stats"
cask "neardrop"
cask "only-switch"
cask "raycast"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "zoom"

# Mac App Store applications
mas "Endel", id: 1346247457
mas "Goodnotes", id: 1444383602
mas "Hotspot Shield", id: 771076721
mas "Microsoft Remote Desktop", id: 1295203466
mas "Quick Camera", id: 598853070
mas "Tailscale", id: 1475387142
mas "Xcode", id: 497799835
mas "Yoink", id: 457622435

# VS Code extensions
vscode "aaron-bond.better-comments"
vscode "alefragnani.bookmarks"
vscode "alexcvzz.vscode-sqlite"
vscode "budparr.language-hugo-vscode"
vscode "christian-kohler.path-intellisense"
vscode "chrmarti.regex"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "ionutvmi.path-autocomplete"
vscode "james-yu.latex-workshop"
vscode "janisdd.vscode-edit-csv"
vscode "marp-team.marp-vscode"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "moozzyk.arduino"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "stephanvs.dot"
vscode "taichi.vscode-textlint"
vscode "tintinweb.graphviz-interactive-preview"
vscode "torn4dom4n.latex-support"
vscode "yzhang.markdown-all-in-one"
vscode "streetsidesoftware.code-spell-checker"  # Spell checking
vscode "usernamehw.errorlens"  # Enhanced error display
vscode "mikestead.dotenv"  # .env file support
vscode "redhat.vscode-yaml"  # YAML support
