tap "brewsci/science"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "mas-cli/tap/mas"
tap "muesli/tap"
tap "sanemat/font"

brew "openssl@3"
brew "cryptography"
brew "ansible"
brew "arp-scan"
brew "awk"
brew "bat"
brew "gcc"
brew "ffmpeg"
brew "pkg-config"
brew "opencv", link: false
brew "python"
brew "cocoapods", link: false
brew "coreutils"
brew "curl"
brew "go"
brew "direnv"
brew "docker"
brew "docker-compose", link: false
brew "docker-credential-helper"
brew "exa"
brew "fzf"
brew "node"
brew "ghostscript", link: false
brew "ghq"
brew "git"
brew "git-lfs"
brew "glfw"
brew "graphviz"
brew "httpie"
brew "hub"
brew "jpeg"
brew "pandoc"
brew "jupyterlab", link: false
brew "mas"
brew "nmap"
brew "peco"
brew "perl"
brew "r"
brew "reattach-to-user-namespace"
brew "rust"
brew "scrcpy"
brew "szip"
brew "tmux"
brew "tree"
brew "typescript"
brew "vim"
brew "wget"
brew "yarn"
brew "youtube-dl"
brew "z"
brew "zplug"
brew "zsh"
brew "zsh-async"
brew "zsh-completions"
brew "sanemat/font/ricty"

cask "alfred"
cask "arduino"
cask "audio-hijack"
cask "bartender"
cask "brave-browser"
cask "charles"
cask "cleanshot"
cask "cmake"
cask "deepl"
cask "discord"
cask "flux"
cask "font-fontawesome"
cask "font-hack-nerd-font"
cask "font-noto-sans-cham"
cask "google-drive"
cask "google-drive-file-stream"
cask "karabiner-elements"
cask "kindle"
cask "loopback"
cask "microsoft-office"
cask "notion"
cask "obs"
cask "processing"
cask "rectangle"
cask "rescuetime"
cask "stats"
cask "vagrant"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "zoom"
cask "zotero"

mas "Amphetamine", id: 937984704
mas "GoodNotes", id: 1444383602
mas "Microsoft Remote Desktop", id: 1295203466
mas "Quick Camera", id: 598853070
mas "Tailscale", id: 1475387142

vscode "aaron-bond.better-comments"
vscode "alefragnani.Bookmarks"
vscode "alexcvzz.vscode-sqlite"
vscode "apollographql.vscode-apollo"
vscode "christian-kohler.path-intellisense"
vscode "chrmarti.regex"
vscode "CoenraadS.bracket-pair-colorizer"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "ionutvmi.path-autocomplete"
vscode "james-yu.latex-workshop"
vscode "mattn.lisp"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-typescript-next"
vscode "octref.vetur"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "stephanvs.dot"
vscode "taichi.vscode-textlint"
vscode "tintinweb.graphviz-interactive-preview"
vscode "torn4dom4n.latex-support"
vscode "twxs.cmake"
vscode "vinicioslc.adb-interface-vscode"
vscode "yzhang.markdown-all-in-one"
vscode "znck.grammarly"