tap "brewsci/science"
tap "grishka/grishka"
tap "homebrew/bundle"
tap "homebrew/services"
tap "muesli/tap"
tap "sanemat/font"

brew "openssl@3"
brew "cryptography"
brew "ansible"
brew "arp-scan"
brew "awk"
brew "bat"
brew "gcc"
brew "ffmpeg"
brew "pkg-config"
brew "opencv", link: false
brew "python"
brew "cocoapods", link: false
brew "coreutils"
brew "curl"
brew "direnv"
brew "go"
brew "direnv"
brew "docker"
brew "docker-compose", link: false
brew "docker-credential-helper"
brew "exa"
brew "fzf"
brew "node"
brew "ghostscript", link: false
brew "ghq"
brew "git"
brew "git-lfs"
brew "glfw"
brew "go"
brew "graphviz"
brew "homerow"
brew "httpie"
brew "hub"
brew "jpeg"
brew "pandoc"
brew "jupyterlab", link: false
brew "llama.cpp"
brew "mas"
brew "nmap"
brew "opencv"
brew "peco"
brew "perl"
brew "r"
brew "reattach-to-user-namespace"
brew "ruby"
brew "rust"
brew "scrcpy"
brew "telnet"
brew "tmux"
brew "tree"
brew "typescript"
brew "vim"
brew "wget"
brew "yarn"
brew "youtube-dl"
brew "z"
brew "zplug"
brew "zsh"
brew "zsh-async"
brew "zsh-completions"
brew "sanemat/font/ricty"

cask "adobe-creative-cloud"
cask "audio-hijack"
cask "deepl"
cask "flux"
cask "font-fontawesome"
# cask "google-chrome"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "kindle"
cask "loopback"
cask "microsoft-office"
cask "notion"
cask "obs"
cask "processing"
cask "rectangle"
cask "rescuetime"
cask "stats"
cask "neardrop"
cask "only-switch"
cask "raycast"
cask "vagrant"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "zoom"

mas "Endel", id: 1346247457
mas "Goodnotes", id: 1444383602
mas "Hotspot Shield", id: 771076721
mas "Microsoft Remote Desktop", id: 1295203466
mas "Quick Camera", id: 598853070
mas "Tailscale", id: 1475387142
mas "Xcode", id: 497799835
mas "Yoink", id: 457622435

vscode "aaron-bond.better-comments"
vscode "alefragnani.bookmarks"
vscode "alexcvzz.vscode-sqlite"
vscode "budparr.language-hugo-vscode"
vscode "christian-kohler.path-intellisense"
vscode "chrmarti.regex"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "ionutvmi.path-autocomplete"
vscode "james-yu.latex-workshop"
vscode "janisdd.vscode-edit-csv"
vscode "marp-team.marp-vscode"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "moozzyk.arduino"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "stephanvs.dot"
vscode "taichi.vscode-textlint"
vscode "tintinweb.graphviz-interactive-preview"
vscode "torn4dom4n.latex-support"
vscode "yzhang.markdown-all-in-one"
